{"33": 0, "34": 1, "35": 2, "35.54": 3, "36": 4, "36.48": 5, "37": 6, "37.38.40.41.49.50.52.53": 7, "37.49": 8, "37.52": 9, "38": 10, "38.39": 11, "38.50": 12, "39": 13, "39.41": 14, "39.51": 15, "40": 16, "40.43": 17, "40.52": 18, "40.60": 19, "40.64": 20, "41": 21, "41.43": 22, "41.45.48.53": 23, "41.48": 24, "41.53": 25, "42": 26, "42.45": 27, "42.57": 28, "43": 29, "43.44": 30, "43.45": 31, "43.47": 32, "43.48": 33, "43.48.51": 34, "43.48.51.57": 35, "43.50": 36, "43.50.55": 37, "43.50.59": 38, "43.52": 39, "43.55": 40, "43.59": 41, "43.64": 42, "43.67": 43, "44": 44, "44.46": 45, "44.48.53": 46, "44.53": 47, "44.54": 48, "44.60": 49, "44.61": 50, "45": 51, "45.46": 52, "45.47": 53, "45.48": 54, "45.49": 55, "45.50": 56, "45.50.53.56.59": 57, "45.52.57": 58, "45.53": 59, "45.56": 60, "45.57": 61, "45.60": 62, "46": 63, "46.47": 64, "46.48": 65, "46.48.55": 66, "46.50": 67, "46.50.55": 68, "46.52": 69, "46.55": 70, "46.58": 71, "47": 72, "47.48": 73, "47.49": 74, "47.50": 75, "47.50.53.56": 76, "47.51": 77, "47.51.54": 78, "47.52.55.59": 79, "47.54": 80, "47.62": 81, "47.63": 82, "48": 83, "48.50": 84, "48.50.53.56.59": 85, "48.50.53.59": 86, "48.50.56": 87, "48.51.55.60": 88, "48.52": 89, "48.52.55.60": 90, "48.53.56.60": 91, "48.55": 92, "48.55.60": 93, "48.56": 94, "48.57": 95, "48.60": 96, "48.64": 97, "49": 98, "49.50": 99, "49.52": 100, "49.52.55": 101, "49.52.55.58": 102, "49.53": 103, "49.53.56": 104, "49.55": 105, "49.57": 106, "49.58": 107, "49.61": 108, "49.64": 109, "50": 110, "50.51": 111, "50.52": 112, "50.53": 113, "50.54": 114, "50.54.57": 115, "50.54.60": 116, "50.55": 117, "50.56": 118, "50.57": 119, "50.58": 120, "50.61": 121, "50.62": 122, "50.66": 123, "51": 124, "51.52": 125, "51.53": 126, "51.54": 127, "51.54.56": 128, "51.55": 129, "51.59": 130, "51.60": 131, "52": 132, "52.53": 133, "52.54": 134, "52.55": 135, "52.55.59": 136, "52.55.60": 137, "52.56": 138, "52.56.59": 139, "52.57": 140, "52.57.64": 141, "52.58": 142, "52.59": 143, "52.60": 144, "52.61": 145, "52.62": 146, "52.62.64": 147, "52.63": 148, "53": 149, "53.55": 150, "53.56": 151, "53.57": 152, "53.57.60.65": 153, "53.58": 154, "53.58.62": 155, "53.60": 156, "53.61": 157, "53.62": 158, "53.65": 159, "54": 160, "54.55": 161, "54.57": 162, "54.57.59": 163, "54.58": 164, "54.59": 165, "54.60": 166, "54.61": 167, "54.62": 168, "54.63": 169, "54.64": 170, "54.74": 171, "55": 172, "55.56": 173, "55.57": 174, "55.58": 175, "55.58.63": 176, "55.59": 177, "55.59.62": 178, "55.60": 179, "55.61": 180, "55.62": 181, "55.63": 182, "55.63.64": 183, "55.64": 184, "55.66": 185, "55.71": 186, "55.76": 187, "56": 188, "56.57": 189, "56.58": 190, "56.59": 191, "56.60": 192, "56.60.61": 193, "56.60.63": 194, "56.61": 195, "56.62": 196, "56.63.64": 197, "56.64": 198, "56.65": 199, "57": 200, "57.58": 201, "57.59": 202, "57.60": 203, "57.60.65": 204, "57.61": 205, "57.62": 206, "57.62.66.69": 207, "57.63": 208, "57.63.72": 209, "57.64": 210, "57.65": 211, "57.66": 212, "57.67": 213, "57.68": 214, "57.69": 215, "57.72": 216, "57.73": 217, "57.76": 218, "57.78": 219, "58": 220, "58.60": 221, "58.61": 222, "58.61.64": 223, "58.62": 224, "58.63": 225, "58.64": 226, "58.65": 227, "58.66": 228, "58.67": 229, "58.68": 230, "58.74": 231, "58.78": 232, "59": 233, "59.59": 234, "59.60": 235, "59.61": 236, "59.62": 237, "59.62.66.71": 238, "59.62.67": 239, "59.63": 240, "59.63.68": 241, "59.64": 242, "59.64.67": 243, "59.64.67.71.76": 244, "59.65": 245, "59.66": 246, "59.66.69.71.75": 247, "59.67": 248, "59.68": 249, "59.71": 250, "59.74": 251, "59.75": 252, "59.76": 253, "59.78": 254, "60": 255, "60.62": 256, "60.62.67": 257, "60.63": 258, "60.63.66": 259, "60.63.68": 260, "60.64": 261, "60.64.67": 262, "60.64.69": 263, "60.65": 264, "60.65.69": 265, "60.65.69.72": 266, "60.65.72": 267, "60.66": 268, "60.67": 269, "60.68": 270, "60.69": 271, "60.70": 272, "60.72": 273, "60.75": 274, "60.76": 275, "61": 276, "61.62": 277, "61.62.64.65.73.74.76.77": 278, "61.63": 279, "61.64": 280, "61.64.67": 281, "61.64.67.70": 282, "61.64.67.70.73.76.79.82": 283, "61.64.69": 284, "61.64.69.73.76.79": 285, "61.64.69.73.76.81": 286, "61.64.73": 287, "61.65": 288, "61.65.68": 289, "61.65.68.73": 290, "61.66": 291, "61.66.70": 292, "61.66.78": 293, "61.67": 294, "61.68.73": 295, "61.69": 296, "61.70": 297, "61.71": 298, "61.76": 299, "61.77": 300, "61.79": 301, "61.81": 302, "62": 303, "62.63": 304, "62.63.65": 305, "62.64": 306, "62.65": 307, "62.65.68.71": 308, "62.65.68.71.74": 309, "62.65.68.71.74.77.80.83": 310, "62.65.69.74": 311, "62.65.69.74.77.81": 312, "62.65.70": 313, "62.65.71": 314, "62.66": 315, "62.66.69": 316, "62.66.69.74": 317, "62.66.74": 318, "62.67": 319, "62.67.70": 320, "62.67.70.74.79": 321, "62.67.71": 322, "62.67.74": 323, "62.68": 324, "62.69": 325, "62.70": 326, "62.71": 327, "62.71.79": 328, "62.72": 329, "62.73": 330, "62.74": 331, "62.77": 332, "62.78": 333, "62.81": 334, "62.83": 335, "63": 336, "63.64": 337, "63.65": 338, "63.66": 339, "63.66.67": 340, "63.66.69": 341, "63.66.69.71": 342, "63.66.70": 343, "63.66.71": 344, "63.67": 345, "63.67.70.75": 346, "63.67.72": 347, "63.68": 348, "63.68.72": 349, "63.69": 350, "63.69.72": 351, "63.70": 352, "63.71": 353, "63.72": 354, "63.73": 355, "63.78": 356, "63.79": 357, "63.80": 358, "64": 359, "64.65": 360, "64.66": 361, "64.66.73": 362, "64.67": 363, "64.67.70": 364, "64.67.70.73.76": 365, "64.67.70.76": 366, "64.67.71": 367, "64.67.71.76": 368, "64.67.72": 369, "64.67.73": 370, "64.68": 371, "64.68.71": 372, "64.68.71.74": 373, "64.68.71.74.76": 374, "64.68.74": 375, "64.69": 376, "64.69.72": 377, "64.69.72.76": 378, "64.69.73": 379, "64.70": 380, "64.70.73": 381, "64.71": 382, "64.71.72": 383, "64.71.74": 384, "64.72": 385, "64.73": 386, "64.73.76.81": 387, "64.74": 388, "64.79": 389, "65": 390, "65.66": 391, "65.67": 392, "65.67.68": 393, "65.68": 394, "65.68.73": 395, "65.68.74": 396, "65.69": 397, "65.69.72": 398, "65.69.72.77": 399, "65.69.74": 400, "65.70": 401, "65.70.74": 402, "65.71": 403, "65.71.74": 404, "65.72": 405, "65.72.75": 406, "65.73": 407, "65.74": 408, "65.77": 409, "65.80": 410, "65.81": 411, "65.82": 412, "66": 413, "66.67": 414, "66.67.71.75.76": 415, "66.68": 416, "66.68.72": 417, "66.69": 418, "66.69.71": 419, "66.69.71.73.76": 420, "66.69.71.75.76": 421, "66.69.74": 422, "66.69.75": 423, "66.69.78": 424, "66.70": 425, "66.71": 426, "66.71.74": 427, "66.71.75": 428, "66.72": 429, "66.73": 430, "66.74": 431, "66.75": 432, "66.76": 433, "66.78": 434, "66.81": 435, "66.83": 436, "67": 437, "67.68": 438, "67.69": 439, "67.69.71.75.76": 440, "67.69.73": 441, "67.70": 442, "67.70.75": 443, "67.71": 444, "67.71.74": 445, "67.71.76": 446, "67.72": 447, "67.72.75": 448, "67.72.75.79": 449, "67.72.76": 450, "67.72.79": 451, "67.73": 452, "67.73.76": 453, "67.73.82": 454, "67.74": 455, "67.74.77": 456, "67.75": 457, "67.76": 458, "67.79": 459, "67.83": 460, "68": 461, "68.69": 462, "68.70": 463, "68.70.72": 464, "68.71": 465, "68.71.76": 466, "68.72": 467, "68.72.75": 468, "68.72.77": 469, "68.73": 470, "68.73.76": 471, "68.74": 472, "68.75": 473, "68.75.80": 474, "68.76": 475, "68.77": 476, "68.80": 477, "69": 478, "69.69": 479, "69.70": 480, "69.71": 481, "69.72": 482, "69.72.76": 483, "69.72.77": 484, "69.73": 485, "69.74": 486, "69.74.77": 487, "69.74.78": 488, "69.75": 489, "69.76": 490, "69.76.79": 491, "69.77": 492, "69.78": 493, "69.79": 494, "69.81": 495, "69.82": 496, "69.84": 497, "70": 498, "70.71": 499, "70.72": 500, "70.72.76": 501, "70.73": 502, "70.73.76": 503, "70.73.79": 504, "70.74": 505, "70.74.77": 506, "70.75": 507, "70.76": 508, "70.77": 509, "70.79": 510, "70.82": 511, "71": 512, "71.71": 513, "71.72": 514, "71.73": 515, "71.74": 516, "71.74.79": 517, "71.75": 518, "71.76": 519, "71.76.79": 520, "71.78": 521, "71.78.81": 522, "71.79": 523, "71.80": 524, "71.81": 525, "71.83": 526, "72": 527, "72.72": 528, "72.73": 529, "72.74": 530, "72.74.78": 531, "72.75": 532, "72.75.80": 533, "72.76": 534, "72.76.79": 535, "72.76.81": 536, "72.77": 537, "72.77.81": 538, "72.78": 539, "72.78.81": 540, "72.79": 541, "72.79.82": 542, "72.81": 543, "72.84": 544, "73": 545, "73.73": 546, "73.74": 547, "73.75": 548, "73.76": 549, "73.76.81": 550, "73.78": 551, "73.79": 552, "73.81": 553, "73.82": 554, "74": 555, "74.75": 556, "74.76": 557, "74.76.80": 558, "74.77": 559, "74.77.81": 560, "74.78": 561, "74.79": 562, "74.81": 563, "74.82": 564, "74.83": 565, "74.84": 566, "75": 567, "75.76": 568, "75.77": 569, "75.78": 570, "75.79": 571, "75.83": 572, "75.84": 573, "76": 574, "76.77": 575, "76.78": 576, "76.78.79": 577, "76.79": 578, "76.79.84": 579, "76.81": 580, "76.82": 581, "76.84": 582, "77": 583, "77.79": 584, "77.79.81": 585, "77.80": 586, "77.81": 587, "77.81.84": 588, "77.82": 589, "78": 590, "78.78": 591, "78.79": 592, "78.81": 593, "79": 594, "79.80": 595, "79.81": 596, "79.82": 597, "80": 598, "80.82": 599, "80.83": 600, "80.84": 601, "81": 602, "81.82": 603, "81.83": 604, "81.84": 605, "82": 606, "82.83": 607, "82.84": 608, "83": 609, "83.85": 610, "84": 611, "85": 612}