{"29.41": 0, "30.42": 1, "31": 2, "31.43": 3, "31.45": 4, "33": 5, "33.36.40.45": 6, "33.36.41.45": 7, "33.45": 8, "34": 9, "34.38": 10, "34.46": 11, "35": 12, "35.38.43.47": 13, "35.38.44.47": 14, "35.47": 15, "36": 16, "36.39": 17, "36.39.43.48.51.55": 18, "36.40.45.48": 19, "36.48": 20, "36.51": 21, "37": 22, "37.49": 23, "38": 24, "38.41": 25, "38.41.45.50.53.57": 26, "38.42": 27, "38.42.45.50": 28, "38.43": 29, "38.45": 30, "38.50": 31, "38.53": 32, "39": 33, "39.42.45.51": 34, "39.43": 35, "39.45": 36, "39.51": 37, "39.55": 38, "40": 39, "40.43": 40, "40.44.47.52": 41, "40.45.49": 42, "40.52": 43, "41": 44, "41.45": 45, "41.50": 46, "41.53": 47, "41.56": 48, "41.57": 49, "41.60": 50, "41.65": 51, "42": 52, "42.45": 53, "42.54": 54, "43": 55, "43.45": 56, "43.46": 57, "43.47": 58, "43.47.50": 59, "43.47.50.55": 60, "43.55": 61, "43.58": 62, "43.59": 63, "43.64": 64, "44": 65, "44.47": 66, "44.53": 67, "44.55": 68, "44.56": 69, "45": 70, "45.47": 71, "45.48": 72, "45.49": 73, "45.49.52.57": 74, "45.50": 75, "45.52": 76, "45.54": 77, "45.55": 78, "45.57": 79, "45.60": 80, "46": 81, "46.48": 82, "46.49": 83, "46.50": 84, "46.51": 85, "46.55": 86, "46.56": 87, "46.57": 88, "46.58": 89, "46.62": 90, "47": 91, "47.48": 92, "47.48.50.52": 93, "47.50": 94, "47.54": 95, "47.55": 96, "47.56": 97, "47.59": 98, "48": 99, "48.50": 100, "48.51": 101, "48.51.55": 102, "48.52": 103, "48.52.55": 104, "48.52.57": 105, "48.53": 106, "48.53.57": 107, "48.54": 108, "48.55": 109, "48.55.58": 110, "48.56": 111, "48.57": 112, "48.58": 113, "48.59": 114, "48.60": 115, "48.63": 116, "49": 117, "49.52": 118, "49.52.57": 119, "49.56.58": 120, "49.57": 121, "49.61": 122, "50": 123, "50.51": 124, "50.52": 125, "50.53": 126, "50.53.57": 127, "50.54": 128, "50.54.57": 129, "50.54.57.60": 130, "50.54.57.62": 131, "50.54.60": 132, "50.55": 133, "50.55.57.61": 134, "50.55.58": 135, "50.55.59": 136, "50.56": 137, "50.56.59": 138, "50.57": 139, "50.57.60": 140, "50.58": 141, "50.59": 142, "50.60": 143, "50.62": 144, "51": 145, "51.53": 146, "51.54": 147, "51.55": 148, "51.55.58": 149, "51.57": 150, "51.60": 151, "51.63": 152, "52": 153, "52.54": 154, "52.55": 155, "52.55.59": 156, "52.55.60": 157, "52.56": 158, "52.57": 159, "52.57.61": 160, "52.58": 161, "52.59": 162, "52.59.62": 163, "52.60": 164, "52.62": 165, "52.64": 166, "53": 167, "53.55": 168, "53.56": 169, "53.56.61": 170, "53.57": 171, "53.57.60": 172, "53.58": 173, "53.59": 174, "53.60": 175, "53.62": 176, "54": 177, "54.55": 178, "54.55.57.59": 179, "54.56": 180, "54.57": 181, "54.57.62": 182, "54.59": 183, "54.60": 184, "54.60.62": 185, "54.61": 186, "54.62": 187, "55": 188, "55.56": 189, "55.57": 190, "55.58": 191, "55.59": 192, "55.59.62": 193, "55.59.64": 194, "55.59.65": 195, "55.60": 196, "55.60.63": 197, "55.61": 198, "55.62": 199, "55.62.65": 200, "55.62.67": 201, "55.63": 202, "55.64": 203, "55.65": 204, "55.66": 205, "55.67": 206, "56": 207, "56.58": 208, "56.59": 209, "56.60": 210, "56.61": 211, "56.62": 212, "56.64": 213, "57": 214, "57.58": 215, "57.59": 216, "57.59.68.69.71.72": 217, "57.60": 218, "57.60.62": 219, "57.60.62.66": 220, "57.60.64": 221, "57.60.65": 222, "57.60.66": 223, "57.61": 224, "57.61.62": 225, "57.61.64": 226, "57.61.64.67": 227, "57.62": 228, "57.62.66": 229, "57.62.69": 230, "57.63": 231, "57.64": 232, "57.64.67": 233, "57.65": 234, "57.66": 235, "57.67": 236, "57.69": 237, "58": 238, "58.60": 239, "58.60.64.67": 240, "58.61": 241, "58.62": 242, "58.62.65": 243, "58.62.67": 244, "58.63": 245, "58.65": 246, "58.67": 247, "59": 248, "59.60": 249, "59.61": 250, "59.62": 251, "59.62.67": 252, "59.62.67.71": 253, "59.63": 254, "59.63.66": 255, "59.64": 256, "59.64.67": 257, "59.64.71": 258, "59.65": 259, "59.65.67": 260, "59.66": 261, "59.66.69": 262, "59.67": 263, "59.68": 264, "60": 265, "60.62": 266, "60.62.64.66": 267, "60.62.68": 268, "60.63": 269, "60.63.65": 270, "60.63.66.69": 271, "60.63.67": 272, "60.64": 273, "60.64.67": 274, "60.64.67.72": 275, "60.65": 276, "60.65.68": 277, "60.65.69": 278, "60.66": 279, "60.66.69": 280, "60.67": 281, "60.67.70": 282, "60.67.72": 283, "60.68": 284, "60.69": 285, "60.70": 286, "60.72": 287, "60.77": 288, "61": 289, "61.62": 290, "61.64": 291, "61.64.69": 292, "61.69": 293, "61.70": 294, "61.76": 295, "62": 296, "62.63": 297, "62.63.66.67": 298, "62.64": 299, "62.65": 300, "62.65.67.71": 301, "62.65.68": 302, "62.65.70": 303, "62.65.71": 304, "62.66": 305, "62.66.69": 306, "62.66.72": 307, "62.67": 308, "62.67.70": 309, "62.67.70.74": 310, "62.67.71": 311, "62.67.74": 312, "62.68": 313, "62.69": 314, "62.69.72": 315, "62.70": 316, "62.70.74": 317, "62.71": 318, "62.72": 319, "62.74": 320, "62.79": 321, "63": 322, "63.64": 323, "63.64.65": 324, "63.65": 325, "63.66": 326, "63.66.72": 327, "63.67": 328, "63.67.72": 329, "63.68": 330, "63.69": 331, "63.69.72": 332, "63.72": 333, "63.75": 334, "63.79": 335, "63.81": 336, "64": 337, "64.65": 338, "64.65.67.69": 339, "64.66": 340, "64.66.67": 341, "64.66.67.69": 342, "64.66.67.69.71.72.74.75": 343, "64.67": 344, "64.67.71": 345, "64.67.72": 346, "64.67.73": 347, "64.68": 348, "64.68.71": 349, "64.69": 350, "64.69.72": 351, "64.69.73": 352, "64.70.73": 353, "64.71": 354, "64.72": 355, "64.73": 356, "64.74": 357, "64.76": 358, "64.79": 359, "65": 360, "65.67": 361, "65.67.71": 362, "65.68": 363, "65.68.74": 364, "65.69": 365, "65.69.74": 366, "65.70": 367, "65.71": 368, "65.71.74": 369, "65.72": 370, "65.73": 371, "65.74": 372, "65.77": 373, "66": 374, "66.67": 375, "66.67.68.69": 376, "66.67.69": 377, "66.67.69.71": 378, "66.68": 379, "66.68.69": 380, "66.68.69.71": 381, "66.69": 382, "66.69.72": 383, "66.69.74": 384, "66.71": 385, "66.72": 386, "66.72.75": 387, "66.73": 388, "66.74": 389, "66.75": 390, "66.78": 391, "67": 392, "67.67": 393, "67.68": 394, "67.69": 395, "67.69.70": 396, "67.69.73.76": 397, "67.69.76": 398, "67.70": 399, "67.70.72.76": 400, "67.70.73": 401, "67.70.74": 402, "67.70.75": 403, "67.71": 404, "67.71.74": 405, "67.71.74.77": 406, "67.71.74.79": 407, "67.72": 408, "67.72.75": 409, "67.72.76": 410, "67.72.76.79": 411, "67.73": 412, "67.73.76": 413, "67.74": 414, "67.75": 415, "67.76": 416, "67.79": 417, "68": 418, "68.69": 419, "68.69.71": 420, "68.69.71.72": 421, "68.71": 422, "68.71.72": 423, "68.71.74": 424, "68.72": 425, "68.74": 426, "68.74.76": 427, "68.74.77": 428, "68.76": 429, "68.77": 430, "68.80": 431, "68.86": 432, "69": 433, "69.71": 434, "69.72": 435, "69.72.74": 436, "69.72.74.78": 437, "69.72.75": 438, "69.72.76": 439, "69.72.77": 440, "69.72.78": 441, "69.73": 442, "69.73.76": 443, "69.73.76.81": 444, "69.73.79": 445, "69.74": 446, "69.74.76": 447, "69.74.77": 448, "69.74.78": 449, "69.74.81": 450, "69.75.81": 451, "69.76": 452, "69.76.79": 453, "69.76.81": 454, "69.77": 455, "69.78": 456, "69.79": 457, "69.81": 458, "69.85": 459, "70": 460, "70.71": 461, "70.72.74": 462, "70.73": 463, "70.73.79": 464, "70.74": 465, "70.74.79": 466, "70.74.81": 467, "70.75.79": 468, "70.76": 469, "70.79": 470, "70.82": 471, "71": 472, "71.72": 473, "71.74": 474, "71.74.76": 475, "71.74.77": 476, "71.74.79": 477, "71.75": 478, "71.76": 479, "71.77": 480, "71.79": 481, "71.81": 482, "71.83": 483, "72": 484, "72.74": 485, "72.74.76.77": 486, "72.75": 487, "72.76": 488, "72.76.79": 489, "72.76.81": 490, "72.77": 491, "72.77.81": 492, "72.78": 493, "72.80": 494, "72.81": 495, "72.82": 496, "72.84": 497, "73": 498, "73.74": 499, "73.74.76": 500, "73.76": 501, "73.76.79": 502, "73.76.86": 503, "73.79": 504, "73.81": 505, "73.85": 506, "74": 507, "74.75": 508, "74.76": 509, "74.76.77.78": 510, "74.77": 511, "74.78": 512, "74.78.81": 513, "74.78.84": 514, "74.79": 515, "74.79.83": 516, "74.79.86": 517, "74.80": 518, "74.80.86": 519, "74.81": 520, "74.81.84": 521, "74.81.86": 522, "74.82": 523, "74.83": 524, "74.86": 525, "75": 526, "75.76": 527, "75.78": 528, "75.79": 529, "75.79.86": 530, "75.80.84": 531, "75.81": 532, "75.88": 533, "76": 534, "76.76": 535, "76.77": 536, "76.77.78": 537, "76.78": 538, "76.79": 539, "76.79.84": 540, "76.80.83.85": 541, "76.81.85": 542, "76.81.85.86": 543, "76.84": 544, "76.88": 545, "77": 546, "77.79": 547, "77.80": 548, "77.81": 549, "77.83": 550, "78": 551, "78.79": 552, "78.79.81": 553, "78.81": 554, "78.81.86": 555, "78.84": 556, "78.86": 557, "79": 558, "79.80": 559, "79.81": 560, "79.81.83": 561, "79.82": 562, "79.83": 563, "79.84": 564, "79.85": 565, "80": 566, "80.82": 567, "81": 568, "81.83": 569, "81.84": 570, "81.85": 571, "82": 572, "82.83.84": 573, "83": 574, "83.84": 575, "84": 576, "84.86": 577, "85": 578, "85.86": 579, "86": 580, "87": 581, "88": 582, "89": 583}