{"100": 0, "101": 1, "24.36": 2, "24.36.48.52.55.60": 3, "24.36.48.53.55.60": 4, "25": 5, "25.37": 6, "25.56": 7, "26.38": 8, "27.39": 9, "28": 10, "28.40": 11, "29": 12, "29.41": 13, "29.41.48.53.56.60": 14, "29.41.48.53.57.60": 15, "30": 16, "30.42": 17, "31": 18, "31.43": 19, "31.43.61.63": 20, "32": 21, "32.39": 22, "32.44": 23, "32.44.46": 24, "32.44.51": 25, "32.44.56": 26, "32.44.61.63": 27, "32.48": 28, "32.51": 29, "32.60": 30, "32.61.63": 31, "32.68.73.76.80": 32, "33": 33, "33.45": 34, "33.45.61": 35, "33.45.61.63": 36, "34": 37, "34.46": 38, "34.46.50.53.58.62": 39, "34.46.53.58.62": 40, "34.48": 41, "34.53": 42, "35": 43, "35.42": 44, "35.47": 45, "35.47.52.64": 46, "35.54.59.63": 47, "36": 48, "36.43": 49, "36.43.48": 50, "36.48": 51, "37": 52, "37.43": 53, "37.44": 54, "37.44.52.56.64": 55, "37.44.52.61": 56, "37.47.53": 57, "37.49": 58, "37.49.56.61.66": 59, "37.49.64.66": 60, "37.51": 61, "37.52": 62, "37.56": 63, "37.61": 64, "37.61.63": 65, "37.63.64": 66, "37.64.66": 67, "37.68": 68, "37.68.69": 69, "37.69": 70, "37.69.70": 71, "38": 72, "38.44": 73, "38.45.50": 74, "38.50": 75, "39": 76, "39.44": 77, "39.45": 78, "39.46": 79, "39.48": 80, "39.49.51": 81, "39.51": 82, "39.52": 83, "39.56": 84, "39.72": 85, "40": 86, "40.41.52": 87, "40.44": 88, "40.44.52": 89, "40.46": 90, "40.49": 91, "40.52": 92, "40.52.68.69": 93, "40.64": 94, "40.64.76": 95, "40.81": 96, "41": 97, "41.47": 98, "41.48": 99, "41.51": 100, "41.53": 101, "42": 102, "42.44.51": 103, "42.46.54": 104, "42.47": 105, "42.48": 106, "42.49": 107, "42.51": 108, "42.54": 109, "42.58": 110, "43": 111, "43.45.55": 112, "43.48": 113, "43.49": 114, "43.50": 115, "43.52": 116, "43.52.55": 117, "43.53": 118, "43.53.55": 119, "43.53.59": 120, "43.55": 121, "44": 122, "44.50": 123, "44.51": 124, "44.51.56": 125, "44.51.60": 126, "44.51.73": 127, "44.52": 128, "44.54": 129, "44.54.60": 130, "44.55": 131, "44.56": 132, "44.56.68": 133, "44.56.73.75": 134, "44.57": 135, "44.61.73": 136, "44.64.76": 137, "44.68": 138, "44.68.73": 139, "44.71.73": 140, "44.72.84": 141, "44.73": 142, "44.73.75.78": 143, "44.73.78": 144, "44.73.85": 145, "44.75": 146, "44.80.82": 147, "44.84.87": 148, "45": 149, "45.51": 150, "45.52": 151, "45.54": 152, "45.57": 153, "45.61.63": 154, "45.65": 155, "45.65.77": 156, "45.68": 157, "45.68.80": 158, "45.72": 159, "45.72.84": 160, "45.75": 161, "45.76": 162, "45.80": 163, "46": 164, "46.48.55.64": 165, "46.50.53": 166, "46.50.56": 167, "46.51": 168, "46.51.55": 169, "46.52": 170, "46.53": 171, "46.53.56": 172, "46.53.62": 173, "46.54": 174, "46.55": 175, "46.58": 176, "46.58.61": 177, "46.71.83": 178, "46.73": 179, "47": 180, "47.51.57": 181, "47.51.59": 182, "47.52": 183, "47.52.55": 184, "47.52.56": 185, "47.52.56.59": 186, "47.52.57": 187, "47.52.59": 188, "47.52.71": 189, "47.52.71.76": 190, "47.53": 191, "47.53.55": 192, "47.54.59": 193, "47.55": 194, "47.55.59": 195, "47.56.66.74": 196, "47.57": 197, "47.59": 198, "47.61": 199, "47.61.73": 200, "47.65.77": 201, "47.68": 202, "47.68.76": 203, "47.70.82": 204, "47.76": 205, "47.81": 206, "48": 207, "48.50": 208, "48.51": 209, "48.51.53": 210, "48.51.56.60": 211, "48.52": 212, "48.52.54.58": 213, "48.52.57": 214, "48.52.58": 215, "48.52.59": 216, "48.53": 217, "48.53.55.60": 218, "48.53.56.60": 219, "48.53.57.60": 220, "48.54": 221, "48.55": 222, "48.55.59": 223, "48.55.60": 224, "48.57": 225, "48.57.60": 226, "48.57.61": 227, "48.57.67.75": 228, "48.58": 229, "48.58.63": 230, "48.60": 231, "48.60.63": 232, "48.63": 233, "48.63.64": 234, "48.68.69": 235, "48.80": 236, "48.80.81": 237, "49": 238, "49.51.55.60.63": 239, "49.52": 240, "49.52.54.58": 241, "49.52.58": 242, "49.53.59": 243, "49.54.58": 244, "49.54.72": 245, "49.54.72.73": 246, "49.55": 247, "49.56": 248, "49.56.59": 249, "49.56.59.65": 250, "49.56.61": 251, "49.58": 252, "49.58.68.76": 253, "49.59.65": 254, "49.61": 255, "49.61.76.78": 256, "49.61.78": 257, "49.68": 258, "49.68.69": 259, "49.69": 260, "49.69.73.81": 261, "49.72": 262, "49.72.73": 263, "49.72.80": 264, "49.73": 265, "49.76.78": 266, "49.77": 267, "49.80": 268, "49.80.81": 269, "49.81": 270, "50": 271, "50.53": 272, "50.53.58.62": 273, "50.53.59": 274, "50.53.59.62": 275, "50.53.60": 276, "50.53.62": 277, "50.54.60": 278, "50.55": 279, "50.55.58": 280, "50.56": 281, "50.56.59": 282, "50.57.60": 283, "50.57.66.74": 284, "50.58": 285, "50.59.69.77": 286, "50.60": 287, "50.62": 288, "51": 289, "51.53": 290, "51.54": 291, "51.54.60": 292, "51.54.71": 293, "51.54.72.75": 294, "51.54.75": 295, "51.54.75.78": 296, "51.54.75.81": 297, "51.54.75.83": 298, "51.54.76.81": 299, "51.54.78": 300, "51.54.80.81": 301, "51.54.81": 302, "51.55": 303, "51.55.60": 304, "51.55.60.63": 305, "51.55.61": 306, "51.55.63": 307, "51.56": 308, "51.56.58.62": 309, "51.56.59": 310, "51.56.59.62": 311, "51.56.60": 312, "51.56.60.63": 313, "51.56.62": 314, "51.56.67.68": 315, "51.56.70.80": 316, "51.56.74.83": 317, "51.56.83.84": 318, "51.57": 319, "51.58": 320, "51.58.61": 321, "51.58.61.67": 322, "51.58.63": 323, "51.58.67.75": 324, "51.59": 325, "51.60": 326, "51.60.70.78": 327, "51.61": 328, "51.63": 329, "51.67": 330, "51.67.75": 331, "51.69": 332, "51.70": 333, "51.70.80": 334, "51.71": 335, "51.71.75.83": 336, "51.72": 337, "51.74.83": 338, "51.75": 339, "51.75.78": 340, "51.75.84": 341, "51.78": 342, "51.78.85.87": 343, "51.79": 344, "51.79.88": 345, "51.81": 346, "51.84": 347, "51.85": 348, "51.87": 349, "52": 350, "52.54.60": 351, "52.55": 352, "52.55.58.60.64": 353, "52.55.59": 354, "52.55.60": 355, "52.55.61": 356, "52.55.61.71": 357, "52.55.62": 358, "52.56": 359, "52.56.59": 360, "52.56.62": 361, "52.56.64": 362, "52.56.68": 363, "52.56.75": 364, "52.56.76.78": 365, "52.57": 366, "52.57.60": 367, "52.57.60.64": 368, "52.57.64": 369, "52.58": 370, "52.58.67.73": 371, "52.59": 372, "52.59.62": 373, "52.59.68.76": 374, "52.60": 375, "52.61": 376, "52.61.71.79": 377, "52.61.73": 378, "52.62": 379, "52.63.75": 380, "52.64": 381, "52.64.80": 382, "52.64.80.81": 383, "52.71": 384, "52.71.76": 385, "52.73": 386, "52.75": 387, "52.76": 388, "53": 389, "53.55.59.63": 390, "53.56": 391, "53.56.58.62": 392, "53.56.61": 393, "53.56.61.65": 394, "53.56.62": 395, "53.56.63": 396, "53.56.65": 397, "53.57": 398, "53.57.60": 399, "53.57.62": 400, "53.57.63": 401, "53.58": 402, "53.58.61": 403, "53.58.61.65": 404, "53.58.62": 405, "53.59": 406, "53.59.62": 407, "53.59.62.68": 408, "53.59.63": 409, "53.59.68.74": 410, "53.60": 411, "53.60.63": 412, "53.60.67": 413, "53.60.69.77": 414, "53.61": 415, "53.62": 416, "53.62.72.80": 417, "53.65": 418, "53.71": 419, "54": 420, "54.56": 421, "54.56.60": 422, "54.56.63": 423, "54.56.68": 424, "54.56.80.81": 425, "54.56.84.87": 426, "54.56.86.87": 427, "54.57": 428, "54.57.62": 429, "54.57.63": 430, "54.57.64": 431, "54.57.66": 432, "54.57.66.69": 433, "54.57.71": 434, "54.57.71.75": 435, "54.57.72.78": 436, "54.57.78": 437, "54.58": 438, "54.58.61.66": 439, "54.58.63": 440, "54.58.64": 441, "54.58.66": 442, "54.59": 443, "54.59.62": 444, "54.59.62.68": 445, "54.59.63": 446, "54.59.63.66": 447, "54.59.64": 448, "54.59.83": 449, "54.60": 450, "54.60.62": 451, "54.60.62.69": 452, "54.60.69.75": 453, "54.61": 454, "54.61.64": 455, "54.61.70": 456, "54.61.70.78": 457, "54.61.75.76": 458, "54.61.84.85": 459, "54.62": 460, "54.62.66": 461, "54.63": 462, "54.63.66": 463, "54.63.73.81": 464, "54.64": 465, "54.64.68": 466, "54.64.76": 467, "54.66": 468, "54.66.69": 469, "54.66.73": 470, "54.68": 471, "54.68.76": 472, "54.69.71": 473, "54.71": 474, "54.72": 475, "54.72.73": 476, "54.72.75": 477, "54.72.78": 478, "54.73": 479, "54.75": 480, "54.75.76": 481, "54.75.78": 482, "54.75.82": 483, "54.75.84": 484, "54.76.81": 485, "54.78": 486, "54.78.81": 487, "54.81": 488, "54.93.95": 489, "54.95": 490, "55": 491, "55.57.64": 492, "55.58.60": 493, "55.58.60.64": 494, "55.58.63": 495, "55.58.63.67": 496, "55.58.64": 497, "55.58.65": 498, "55.59": 499, "55.59.62.67": 500, "55.59.63.66": 501, "55.59.63.67": 502, "55.59.64": 503, "55.59.67": 504, "55.60": 505, "55.60.63": 506, "55.60.63.67": 507, "55.60.63.69": 508, "55.60.64": 509, "55.60.66": 510, "55.61": 511, "55.61.63.70": 512, "55.61.64": 513, "55.61.70.76": 514, "55.61.88": 515, "55.62": 516, "55.62.67": 517, "55.62.71.79": 518, "55.63": 519, "55.64": 520, "55.65": 521, "55.67": 522, "55.69": 523, "56": 524, "56.58": 525, "56.58.62.65": 526, "56.58.65": 527, "56.58.68.70": 528, "56.58.73": 529, "56.58.73.76": 530, "56.58.75": 531, "56.58.76.80": 532, "56.59": 533, "56.59.61": 534, "56.59.62": 535, "56.59.63": 536, "56.59.64": 537, "56.59.65": 538, "56.59.74.75": 539, "56.59.75": 540, "56.59.80.82": 541, "56.60": 542, "56.60.63": 543, "56.60.63.68": 544, "56.60.65": 545, "56.60.66": 546, "56.60.66.68": 547, "56.60.67": 548, "56.60.68": 549, "56.60.79.80": 550, "56.60.82.83": 551, "56.61": 552, "56.61.63": 553, "56.61.64.68": 554, "56.61.64.70": 555, "56.61.65": 556, "56.61.66": 557, "56.61.66.68": 558, "56.61.73": 559, "56.61.73.75": 560, "56.61.75": 561, "56.61.76": 562, "56.61.76.80": 563, "56.61.77": 564, "56.62": 565, "56.62.64.71": 566, "56.62.65": 567, "56.62.65.71": 568, "56.62.71.77": 569, "56.63": 570, "56.63.66": 571, "56.63.66.68": 572, "56.63.68": 573, "56.63.72.80": 574, "56.64": 575, "56.64.68": 576, "56.65": 577, "56.65.68": 578, "56.66": 579, "56.66.68": 580, "56.67": 581, "56.68": 582, "56.68.69": 583, "56.68.70": 584, "56.68.70.80": 585, "56.68.80": 586, "56.68.85.87": 587, "56.70": 588, "56.73": 589, "56.73.75": 590, "56.75": 591, "56.75.76": 592, "56.76": 593, "56.76.78": 594, "56.76.80": 595, "56.76.80.88": 596, "56.77": 597, "56.77.78": 598, "56.78": 599, "56.79.80": 600, "56.80": 601, "56.80.82": 602, "56.85.86": 603, "56.86.87": 604, "57": 605, "57.59": 606, "57.59.66.78": 607, "57.59.75": 608, "57.60": 609, "57.60.64": 610, "57.60.65": 611, "57.60.66": 612, "57.60.66.69": 613, "57.61": 614, "57.61.66": 615, "57.61.67": 616, "57.61.68": 617, "57.61.73": 618, "57.61.78": 619, "57.61.81.85": 620, "57.62": 621, "57.62.65": 622, "57.62.65.71": 623, "57.62.66": 624, "57.62.69": 625, "57.63": 626, "57.63.65": 627, "57.63.65.72": 628, "57.63.66": 629, "57.63.68": 630, "57.63.69": 631, "57.63.71": 632, "57.63.72.78": 633, "57.63.75": 634, "57.64": 635, "57.64.66.69": 636, "57.64.67": 637, "57.64.73.81": 638, "57.65": 639, "57.65.77": 640, "57.66": 641, "57.66.78": 642, "57.68": 643, "57.69": 644, "57.69.73": 645, "57.75": 646, "57.78": 647, "57.85": 648, "57.85.87": 649, "57.87": 650, "58": 651, "58.60.66": 652, "58.61": 653, "58.61.64": 654, "58.61.65": 655, "58.61.66": 656, "58.61.66.70": 657, "58.61.67": 658, "58.61.72.73": 659, "58.61.80": 660, "58.61.87": 661, "58.62": 662, "58.62.67": 663, "58.62.70": 664, "58.63": 665, "58.63.66.72": 666, "58.63.67": 667, "58.64": 668, "58.64.66.73": 669, "58.64.67.73": 670, "58.64.70": 671, "58.64.73.79": 672, "58.65.68": 673, "58.65.74": 674, "58.66": 675, "58.66.78": 676, "58.67": 677, "58.67.70": 678, "58.68": 679, "58.68.70": 680, "58.70": 681, "58.70.82": 682, "58.72": 683, "58.73": 684, "58.78": 685, "58.87.88": 686, "59": 687, "59.60.64": 688, "59.61": 689, "59.61.65.68": 690, "59.61.67": 691, "59.61.68": 692, "59.62": 693, "59.62.67": 694, "59.62.68": 695, "59.63": 696, "59.63.65.68": 697, "59.63.66": 698, "59.63.66.71": 699, "59.63.67": 700, "59.63.68": 701, "59.63.68.71": 702, "59.63.75": 703, "59.63.75.83": 704, "59.64": 705, "59.64.66.71": 706, "59.64.67": 707, "59.64.67.73": 708, "59.64.68": 709, "59.65": 710, "59.65.67.74": 711, "59.65.74.80": 712, "59.66": 713, "59.66.71": 714, "59.66.78": 715, "59.67": 716, "59.68": 717, "59.68.70": 718, "59.69": 719, "59.70": 720, "59.71": 721, "59.71.78": 722, "59.71.83": 723, "59.74": 724, "59.74.75": 725, "59.75.76": 726, "60": 727, "60.61": 728, "60.62.66.71": 729, "60.62.66.74": 730, "60.63": 731, "60.63.66": 732, "60.63.66.69": 733, "60.63.67": 734, "60.63.67.72": 735, "60.63.68": 736, "60.64": 737, "60.64.66.72": 738, "60.64.67": 739, "60.64.69": 740, "60.64.72": 741, "60.65": 742, "60.65.68": 743, "60.65.68.74": 744, "60.65.69": 745, "60.66": 746, "60.66.68": 747, "60.66.68.75": 748, "60.66.69.75": 749, "60.66.70": 750, "60.66.75.81": 751, "60.66.77": 752, "60.66.81.82": 753, "60.67": 754, "60.67.72": 755, "60.68": 756, "60.68.69": 757, "60.68.77": 758, "60.69": 759, "60.70": 760, "60.72": 761, "60.72.84": 762, "60.75": 763, "60.77": 764, "60.78.79.81": 765, "60.78.80": 766, "60.79.80": 767, "60.84": 768, "61": 769, "61.63": 770, "61.63.67": 771, "61.63.67.70": 772, "61.63.70": 773, "61.63.75.76": 774, "61.63.78": 775, "61.63.79": 776, "61.63.83": 777, "61.63.90.92": 778, "61.63.92.93": 779, "61.64": 780, "61.64.67": 781, "61.64.68.73": 782, "61.64.69": 783, "61.64.69.71": 784, "61.64.69.86.87": 785, "61.64.71.73": 786, "61.64.72.73": 787, "61.64.73": 788, "61.64.73.76": 789, "61.64.87.88": 790, "61.64.88": 791, "61.65": 792, "61.65.70": 793, "61.65.73": 794, "61.65.77.78": 795, "61.65.80.85": 796, "61.66": 797, "61.66.69.73": 798, "61.66.69.75": 799, "61.66.70": 800, "61.66.73.74": 801, "61.66.78.80": 802, "61.66.78.81": 803, "61.66.81": 804, "61.66.81.85": 805, "61.67": 806, "61.67.68": 807, "61.67.69.76": 808, "61.67.70": 809, "61.67.76.82": 810, "61.68": 811, "61.68.71": 812, "61.68.73": 813, "61.68.76.88": 814, "61.68.77": 815, "61.68.88": 816, "61.69": 817, "61.69.87.88": 818, "61.70": 819, "61.71": 820, "61.72.73": 821, "61.73": 822, "61.73.74": 823, "61.73.75": 824, "61.73.88.90": 825, "61.75.76": 826, "61.75.78": 827, "61.76": 828, "61.78.79": 829, "61.79.80": 830, "61.80": 831, "61.80.85": 832, "61.81": 833, "61.81.85": 834, "61.85": 835, "61.85.90": 836, "61.88": 837, "62": 838, "62.64": 839, "62.65": 840, "62.65.69": 841, "62.65.71": 842, "62.65.72": 843, "62.66": 844, "62.66.71": 845, "62.66.73": 846, "62.66.74": 847, "62.67": 848, "62.67.71": 849, "62.67.74": 850, "62.68": 851, "62.68.70": 852, "62.68.71": 853, "62.68.71.77": 854, "62.68.72": 855, "62.68.73": 856, "62.68.74": 857, "62.68.77.83": 858, "62.69": 859, "62.69.73": 860, "62.69.74": 861, "62.70": 862, "62.71": 863, "62.72": 864, "62.74": 865, "63": 866, "63.64.75.76": 867, "63.65": 868, "63.66": 869, "63.66.68": 870, "63.66.69": 871, "63.66.73.75": 872, "63.67.75": 873, "63.67.79": 874, "63.68": 875, "63.68.71.75": 876, "63.68.72": 877, "63.68.75": 878, "63.69": 879, "63.69.71": 880, "63.69.72": 881, "63.69.73": 882, "63.69.78.84": 883, "63.69.80.81": 884, "63.69.87.88": 885, "63.70": 886, "63.70.75": 887, "63.71": 888, "63.71.75": 889, "63.72": 890, "63.73": 891, "63.73.75": 892, "63.74": 893, "63.75": 894, "63.75.83": 895, "63.79.80": 896, "63.82.83": 897, "63.87.88": 898, "64": 899, "64.66": 900, "64.67": 901, "64.67.68": 902, "64.67.72": 903, "64.67.72.76": 904, "64.67.74.76": 905, "64.67.76": 906, "64.68": 907, "64.68.70": 908, "64.68.71": 909, "64.68.71.76": 910, "64.68.73": 911, "64.68.73.76": 912, "64.69": 913, "64.69.71": 914, "64.69.72": 915, "64.69.73": 916, "64.69.86.87": 917, "64.70": 918, "64.70.72": 919, "64.70.73": 920, "64.70.73.79": 921, "64.70.76": 922, "64.70.79.85": 923, "64.71": 924, "64.71.74": 925, "64.72": 926, "64.72.73": 927, "64.72.76": 928, "64.73": 929, "64.73.85": 930, "64.76": 931, "64.76.92": 932, "64.76.93": 933, "64.80.81": 934, "65": 935, "65.67": 936, "65.67.71": 937, "65.68": 938, "65.68.72": 939, "65.68.77": 940, "65.69": 941, "65.69.72": 942, "65.69.73": 943, "65.69.74": 944, "65.69.77": 945, "65.70": 946, "65.70.73": 947, "65.70.73.77": 948, "65.71": 949, "65.71.74": 950, "65.71.76": 951, "65.71.76.77": 952, "65.72": 953, "65.72.76": 954, "65.72.77": 955, "65.73": 956, "65.74": 957, "65.75": 958, "65.76": 959, "65.77": 960, "65.77.78": 961, "66": 962, "66.68": 963, "66.68.71.78": 964, "66.68.73": 965, "66.68.78.80": 966, "66.69": 967, "66.69.71": 968, "66.69.72": 969, "66.69.73.78": 970, "66.69.75": 971, "66.69.77.78": 972, "66.70": 973, "66.70.73.78": 974, "66.70.75.78": 975, "66.70.76": 976, "66.70.78": 977, "66.71": 978, "66.71.74": 979, "66.71.75.78": 980, "66.72": 981, "66.72.73": 982, "66.72.75": 983, "66.72.75.81": 984, "66.73": 985, "66.73.76.78": 986, "66.74": 987, "66.75": 988, "66.75.78": 989, "66.76": 990, "66.78": 991, "66.78.80": 992, "66.80.81": 993, "67": 994, "67.67.72.73.79.79": 995, "67.68": 996, "67.69": 997, "67.70": 998, "67.70.75": 999, "67.70.75.79": 1000, "67.70.79": 1001, "67.71": 1002, "67.71.74": 1003, "67.71.76": 1004, "67.71.79": 1005, "67.72": 1006, "67.72.75.79": 1007, "67.72.76": 1008, "67.72.77": 1009, "67.72.79": 1010, "67.73": 1011, "67.73.79": 1012, "67.73.82.88": 1013, "67.74": 1014, "67.74.79": 1015, "67.75": 1016, "67.75.79": 1017, "67.76": 1018, "67.77": 1019, "67.79": 1020, "67.82.83": 1021, "67.85": 1022, "68": 1023, "68.69": 1024, "68.69.80": 1025, "68.70": 1026, "68.70.73.80": 1027, "68.70.80": 1028, "68.71": 1029, "68.71.74": 1030, "68.71.74.76": 1031, "68.71.76": 1032, "68.71.76.80": 1033, "68.72": 1034, "68.72.75": 1035, "68.72.75.80": 1036, "68.73": 1037, "68.73.76": 1038, "68.73.80": 1039, "68.74": 1040, "68.74.76": 1041, "68.74.77": 1042, "68.74.80": 1043, "68.75": 1044, "68.75.77.80": 1045, "68.75.78.80": 1046, "68.76": 1047, "68.76.80": 1048, "68.77": 1049, "68.77.80": 1050, "68.78": 1051, "68.78.80": 1052, "68.79.79": 1053, "68.80": 1054, "68.84": 1055, "69": 1056, "69.70": 1057, "69.71": 1058, "69.72": 1059, "69.72.73": 1060, "69.72.75": 1061, "69.72.75.81": 1062, "69.72.76": 1063, "69.72.77": 1064, "69.72.78": 1065, "69.72.81": 1066, "69.73": 1067, "69.73.76": 1068, "69.73.78": 1069, "69.73.78.81": 1070, "69.73.81": 1071, "69.74": 1072, "69.74.75": 1073, "69.74.77": 1074, "69.74.78": 1075, "69.74.81.86": 1076, "69.75": 1077, "69.75.77": 1078, "69.75.77.81": 1079, "69.75.78": 1080, "69.75.81": 1081, "69.76": 1082, "69.76.85": 1083, "69.77": 1084, "69.77.78": 1085, "69.78": 1086, "69.80.81": 1087, "69.81": 1088, "69.90": 1089, "70": 1090, "70.71": 1091, "70.71.73.74": 1092, "70.71.82": 1093, "70.72": 1094, "70.72.73.75": 1095, "70.72.78.80": 1096, "70.73": 1097, "70.73.77": 1098, "70.73.82": 1099, "70.74": 1100, "70.74.76": 1101, "70.74.77": 1102, "70.75": 1103, "70.75.78": 1104, "70.75.79": 1105, "70.75.80": 1106, "70.76": 1107, "70.76.85.91": 1108, "70.77": 1109, "70.77.80.82": 1110, "70.77.82": 1111, "70.77.86": 1112, "70.78": 1113, "70.79": 1114, "70.79.79": 1115, "70.79.82": 1116, "70.80": 1117, "70.81": 1118, "70.82": 1119, "70.82.85": 1120, "70.84": 1121, "70.85": 1122, "70.89": 1123, "70.97": 1124, "71": 1125, "71.72": 1126, "71.72.80": 1127, "71.73": 1128, "71.73.74": 1129, "71.74": 1130, "71.74.77.79.83": 1131, "71.74.80": 1132, "71.75": 1133, "71.75.78": 1134, "71.75.80.83": 1135, "71.76": 1136, "71.76.77": 1137, "71.76.79": 1138, "71.76.80": 1139, "71.77": 1140, "71.77.80": 1141, "71.77.80.83": 1142, "71.77.83": 1143, "71.78": 1144, "71.78.87": 1145, "71.79": 1146, "71.79.79": 1147, "71.79.83": 1148, "71.80": 1149, "71.83": 1150, "72": 1151, "72.73": 1152, "72.73.75": 1153, "72.74": 1154, "72.75": 1155, "72.75.77": 1156, "72.75.78": 1157, "72.75.79": 1158, "72.76": 1159, "72.76.81": 1160, "72.76.84": 1161, "72.77": 1162, "72.77.82": 1163, "72.77.84": 1164, "72.78": 1165, "72.79": 1166, "72.79.79": 1167, "72.79.82.84": 1168, "72.79.88": 1169, "72.80": 1170, "72.81": 1171, "72.82": 1172, "72.84": 1173, "73": 1174, "73.73": 1175, "73.74": 1176, "73.74.80": 1177, "73.74.82": 1178, "73.75": 1179, "73.75.77": 1180, "73.75.77.78.80": 1181, "73.75.80": 1182, "73.75.82.84": 1183, "73.76": 1184, "73.77": 1185, "73.77.80.83": 1186, "73.78": 1187, "73.78.80": 1188, "73.79": 1189, "73.79.79": 1190, "73.79.82": 1191, "73.79.82.85": 1192, "73.79.88.94": 1193, "73.80": 1194, "73.81": 1195, "73.81.85": 1196, "73.82": 1197, "73.82.85": 1198, "73.84": 1199, "73.84.84": 1200, "73.85": 1201, "73.87": 1202, "73.88.90": 1203, "74": 1204, "74.75": 1205, "74.76": 1206, "74.76.81": 1207, "74.77": 1208, "74.77.79.86": 1209, "74.77.80": 1210, "74.77.81": 1211, "74.77.82": 1212, "74.77.82.86": 1213, "74.77.83": 1214, "74.77.83.86": 1215, "74.78": 1216, "74.79": 1217, "74.79.79": 1218, "74.80": 1219, "74.80.81.82": 1220, "74.81": 1221, "74.81.85": 1222, "74.81.86": 1223, "74.82": 1224, "74.82.86": 1225, "74.83": 1226, "74.86": 1227, "75": 1228, "75.76": 1229, "75.76.77": 1230, "75.76.80": 1231, "75.77": 1232, "75.77.78.80": 1233, "75.77.81": 1234, "75.77.83.85": 1235, "75.77.84.85": 1236, "75.78": 1237, "75.78.81": 1238, "75.78.82": 1239, "75.78.84": 1240, "75.79": 1241, "75.79.83": 1242, "75.79.84": 1243, "75.80": 1244, "75.81": 1245, "75.82": 1246, "75.82.87": 1247, "75.83": 1248, "75.84": 1249, "75.87": 1250, "75.90": 1251, "75.91": 1252, "76": 1253, "76.77": 1254, "76.77.79": 1255, "76.77.82": 1256, "76.78": 1257, "76.78.80": 1258, "76.78.80.81": 1259, "76.79": 1260, "76.79.83": 1261, "76.80": 1262, "76.81.84": 1263, "76.81.85": 1264, "76.82": 1265, "76.82.88": 1266, "76.82.91.100": 1267, "76.83": 1268, "76.84": 1269, "76.84.84": 1270, "76.85": 1271, "76.88": 1272, "76.91": 1273, "77": 1274, "77.78": 1275, "77.78.80": 1276, "77.78.80.82": 1277, "77.79": 1278, "77.79.86.89": 1279, "77.79.86.91": 1280, "77.80": 1281, "77.80.85.89": 1282, "77.81.85": 1283, "77.81.86": 1284, "77.82": 1285, "77.82.86": 1286, "77.82.86.89": 1287, "77.83": 1288, "77.84.84": 1289, "77.84.89": 1290, "77.85": 1291, "77.86": 1292, "77.89": 1293, "77.92": 1294, "78": 1295, "78.79": 1296, "78.80": 1297, "78.81": 1298, "78.81.83": 1299, "78.82": 1300, "78.84": 1301, "78.84.84": 1302, "78.85": 1303, "78.86": 1304, "78.87": 1305, "78.87.90": 1306, "78.90": 1307, "78.92": 1308, "78.93": 1309, "79": 1310, "79.79": 1311, "79.80": 1312, "79.81": 1313, "79.82": 1314, "79.82.86": 1315, "79.82.87.91": 1316, "79.83": 1317, "79.85": 1318, "79.86": 1319, "79.87": 1320, "79.87.91": 1321, "79.88": 1322, "79.91": 1323, "79.94": 1324, "80": 1325, "80.80": 1326, "80.81": 1327, "80.82": 1328, "80.83": 1329, "80.83.88": 1330, "80.84": 1331, "80.84.89.92": 1332, "80.85": 1333, "80.86": 1334, "80.86.88": 1335, "80.87": 1336, "80.89": 1337, "80.90": 1338, "80.92": 1339, "81": 1340, "81.82": 1341, "81.83": 1342, "81.84": 1343, "81.84.89": 1344, "81.85": 1345, "81.86": 1346, "81.86.89": 1347, "81.87": 1348, "81.89": 1349, "81.90": 1350, "81.93": 1351, "82": 1352, "82.83": 1353, "82.83.85.87": 1354, "82.84": 1355, "82.85": 1356, "82.87": 1357, "82.88": 1358, "82.90": 1359, "82.91": 1360, "82.92": 1361, "82.94": 1362, "83": 1363, "83.84": 1364, "83.85": 1365, "83.87": 1366, "83.92": 1367, "83.94.95": 1368, "83.95": 1369, "84": 1370, "84.84": 1371, "84.85": 1372, "84.85.87.89": 1373, "84.86": 1374, "84.87": 1375, "84.88.93": 1376, "84.89.93": 1377, "84.92": 1378, "84.93": 1379, "84.96": 1380, "85": 1381, "85.85": 1382, "85.86.87": 1383, "85.87": 1384, "85.87.92": 1385, "85.87.94.96": 1386, "85.88": 1387, "85.89": 1388, "85.89.92.95": 1389, "85.90": 1390, "85.91": 1391, "85.92": 1392, "85.94": 1393, "85.97": 1394, "85.99": 1395, "86": 1396, "86.87": 1397, "86.88.93": 1398, "86.89": 1399, "86.92": 1400, "86.95": 1401, "86.98": 1402, "87": 1403, "87.88": 1404, "87.88.95": 1405, "87.90": 1406, "87.92": 1407, "87.94": 1408, "87.95": 1409, "87.99": 1410, "88": 1411, "88.100": 1412, "88.89": 1413, "88.89.90": 1414, "88.89.95": 1415, "88.91": 1416, "89": 1417, "89.90": 1418, "89.90.92.94.95": 1419, "89.90.95": 1420, "89.95": 1421, "89.97": 1422, "90": 1423, "90.91": 1424, "90.91.95": 1425, "90.92": 1426, "90.92.94.95": 1427, "90.93": 1428, "90.94": 1429, "90.96": 1430, "90.99": 1431, "91": 1432, "91.92": 1433, "91.92.93": 1434, "91.92.95": 1435, "92": 1436, "92.101": 1437, "92.93": 1438, "92.94": 1439, "92.97": 1440, "93": 1441, "93.94": 1442, "93.99": 1443, "94": 1444, "94.100": 1445, "94.97": 1446, "95": 1447, "95.99": 1448, "96": 1449, "97": 1450, "97.99": 1451, "97.99.101": 1452, "98": 1453, "99": 1454}